## 50.如何在Pandas中对数据进行标准化（正态化）处理？

In [1]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import StandardScaler

In [2]:
data = {'A':[1,2,3,4,5],
        'B':[100,200,300,400,500],
        'C':[1000,2000,3000,4000,5000]}
df = pd.DataFrame(data)
df

   A    B     C
0  1  100  1000
1  2  200  2000
2  3  300  3000
3  4  400  4000
4  5  500  5000

In [3]:
scaler = StandardScaler().fit(df)
df_std = scaler.transform(df)
df_std

array([[-1.41421356, -1.41421356, -1.41421356],
       [-0.70710678, -0.70710678, -0.70710678],
       [ 0.        ,  0.        ,  0.        ],
       [ 0.70710678,  0.70710678,  0.70710678],
       [ 1.41421356,  1.41421356,  1.41421356]])

## 51.如何在Pandas中对数据进行归一化处理？

In [4]:
from sklearn.preprocessing import MinMaxScaler

In [5]:
data = {'A':[1,2,3,4,5],
        'B':[100,200,300,400,500],
        'C':[1000,2000,3000,4000,5000]}
df = pd.DataFrame(data)
df

   A    B     C
0  1  100  1000
1  2  200  2000
2  3  300  3000
3  4  400  4000
4  5  500  5000

In [6]:
scaler = MinMaxScaler().fit(df)
df_nom = scaler.transform(df)
df_nom

array([[0.  , 0.  , 0.  ],
       [0.25, 0.25, 0.25],
       [0.5 , 0.5 , 0.5 ],
       [0.75, 0.75, 0.75],
       [1.  , 1.  , 1.  ]])

## 52.如何在Pandas中使用透视表进行数据汇总？

In [9]:
data = {
    'Year':[2018,2018,2019,2019,2020,2020],
    'Month':[1,2,1,2,1,2],
    'Sales':[100,200,300,400,500,600]
}
df = pd.DataFrame(data=data)
df

   Year  Month  Sales
0  2018      1    100
1  2018      2    200
2  2019      1    300
3  2019      2    400
4  2020      1    500
5  2020      2    600

In [10]:
table = pd.pivot_table(df,values='Sales',index='Year',columns='Month',aggfunc='sum')

In [11]:
table

Month    1    2
Year
2018   100  200
2019   300  400
2020   500  600

## 53.如何在Pandas中使用groupby函数进行数据汇总？

In [12]:
groupby = df.groupby([
    'Year','Month'
])
result = groupby.sum()

In [13]:
result

            Sales
Year Month
2018 1        100
     2        200
2019 1        300
     2        400
2020 1        500
     2        600

## 54.如何在Pandas中使用rolling函数进行移动窗口统计？

In [14]:
ser = pd.Series(np.random.randn(10))

In [15]:
ser

0    1.260264
1   -0.165063
2   -1.520055
3   -1.759473
4   -0.576962
5    0.495707
6   -1.454073
7    1.461740
8   -1.134616
9    0.777219
dtype: float64

In [16]:
rolling_window = ser.rolling(window=3)
rolling_mean = rolling_window.mean()
rolling_mean

0         NaN
1         NaN
2   -0.141618
3   -1.148197
4   -1.285497
5   -0.613576
6   -0.511776
7    0.167791
8   -0.375650
9    0.368115
dtype: float64

## 55.如何在Pandas中使用shift函数进行时间序列处理？

In [17]:
rs = pd.Series(np.random.randn(10),index=pd.date_range('20230101',periods=10))
rs

2023-01-01    0.135595
2023-01-02    0.081095
2023-01-03   -0.033634
2023-01-04    1.532020
2023-01-05    0.843069
2023-01-06   -0.995572
2023-01-07   -0.978822
2023-01-08    0.282602
2023-01-09    0.943766
2023-01-10   -0.868942
Freq: D, dtype: float64

In [18]:
shifted = rs.shift(periods=-1)
shifted

2023-01-01    0.081095
2023-01-02   -0.033634
2023-01-03    1.532020
2023-01-04    0.843069
2023-01-05   -0.995572
2023-01-06   -0.978822
2023-01-07    0.282602
2023-01-08    0.943766
2023-01-09   -0.868942
2023-01-10         NaN
Freq: D, dtype: float64

## 56.如何在Pandas中使用 set_index 函数进行数据索引操作？

In [19]:
df = pd.DataFrame({
    'A':['foo','bar','foo','bar','foo','bar','foo','bar'],
    'B':['one','one','two','three','two','two','one','three'],
    'C':[1,2,3,4,5,6,7,8],
    'D':[8,7,6,5,4,3,2,1]
})
df

     A      B  C  D
0  foo    one  1  8
1  bar    one  2  7
2  foo    two  3  6
3  bar  three  4  5
4  foo    two  5  4
5  bar    two  6  3
6  foo    one  7  2
7  bar  three  8  1

In [21]:
indexed = df.set_index(['A','B'])
indexed

           C  D
A   B
foo one    1  8
bar one    2  7
foo two    3  6
bar three  4  5
foo two    5  4
bar two    6  3
foo one    7  2
bar three  8  1

## 57.如何在Pandas中使用 reset_index 函数进行索引重置操作？

In [22]:
reseted = indexed.reset_index()

In [23]:
reseted

     A      B  C  D
0  foo    one  1  8
1  bar    one  2  7
2  foo    two  3  6
3  bar  three  4  5
4  foo    two  5  4
5  bar    two  6  3
6  foo    one  7  2
7  bar  three  8  1

## 58.如何在Pandas中使用map函数进行数据映射操作？

In [24]:
df = pd.DataFrame({
    'name':['Alice','Bob','Charlie','David'],
    'gender':['female','male','female','male']
})
df

      name  gender
0    Alice  female
1      Bob    male
2  Charlie  female
3    David    male

In [25]:
mapping = {'male':0,'female':1}

In [26]:
df['gender'] = df['gender'].map(mapping)
df

      name  gender
0    Alice       1
1      Bob       0
2  Charlie       1
3    David       0

## 59.如何在Pandas中使用apply函数进行元素级函数应用？

In [27]:
df = pd.DataFrame({
    'A':[1,2,3],
    'B':[4,5,6]
})
df

   A  B
0  1  4
1  2  5
2  3  6

In [28]:
def mulitply_by_2(x):
    return x*2

In [29]:
result = df.apply(mulitply_by_2)
result

   A   B
0  2   8
1  4  10
2  6  12

## 60.如何在Pandas中使用agg函数进行分组聚合操作？

In [36]:
df = pd.DataFrame({
    'column':[1,2,3,1,2],
    'other_column':[4,5,6,7,8]
})
df

   column  other_column
0       1             4
1       2             5
2       3             6
3       1             7
4       2             8

In [37]:
grouped = df.groupby('column')

In [38]:
grouped

In [39]:
result = grouped.agg({'other_column':'sum'})

In [40]:
result

        other_column
column
1                 11
2                 13
3                  6

## 61.如何在Pandas中使用transform函数进行分组变换操作？

In [41]:
data = pd.DataFrame({
    'A':['foo','bar','foo','bar','foo','bar','foo','bar'],
    'B':['one','one','two','three','two','two','one','three'],
    'C':[1,2,3,4,5,6,7,8],
    'D':[8,7,6,5,4,3,2,1]
})
data

     A      B  C  D
0  foo    one  1  8
1  bar    one  2  7
2  foo    two  3  6
3  bar  three  4  5
4  foo    two  5  4
5  bar    two  6  3
6  foo    one  7  2
7  bar  three  8  1

In [42]:
grouped = data.groupby('A')
grouped

In [43]:
data['C_mean'] = grouped['C'].transform(lambda x : x.mean())
data['D_mean'] = grouped['D'].transform(lambda x : x.mean())

In [44]:
data

     A      B  C  D  C_mean  D_mean
0  foo    one  1  8     4.0     5.0
1  bar    one  2  7     5.0     4.0
2  foo    two  3  6     4.0     5.0
3  bar  three  4  5     5.0     4.0
4  foo    two  5  4     4.0     5.0
5  bar    two  6  3     5.0     4.0
6  foo    one  7  2     4.0     5.0
7  bar  three  8  1     5.0     4.0

## 62.如何在Pandas中使用 stack 和 unstack 函数进行数据透视操作？

In [47]:
data = {
    'name':['Alice','Bob','Charlie'],
    'year':[2018,2019,2020],
    'sales':[100,200,300]
}
df = pd.DataFrame(data=data)
df

      name  year  sales
0    Alice  2018    100
1      Bob  2019    200
2  Charlie  2020    300

In [48]:
df.set_index('year',inplace=True)
stacked = df.stack()
stacked

year
2018  name       Alice
      sales        100
2019  name         Bob
      sales        200
2020  name     Charlie
      sales        300
dtype: object

In [49]:
unstacked = stacked.unstack()
unstacked

         name sales
year
2018    Alice   100
2019      Bob   200
2020  Charlie   300